{
 "cells": [
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "from rdflib import Graph, RDF, URIRef, Namespace\n",
    "from pandas import Series, DataFrame\n",
    "import numpy as np\n",
    "import matplotlib.pyplot as plt\n",
    "import math\n",
    "import operator\n",
    "import datetime\n",
    "import pandas as pnd"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 2,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "<Graph identifier=N3e02622b5f204b41af90d2dafb1bb428 (<class 'rdflib.graph.Graph'>)>"
      ]
     },
     "execution_count": 2,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "g = Graph()\n",
    "g.parse(\"../graph/experiment_graph.ttl\", format=\"turtle\")"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 3,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "foaf = Namespace(\"http://xmlns.com/foaf/0.1/\")\n",
    "ns = dict(api_network=Namespace(\"http://deepweb.ut.ee/ontologies/api-network#\"), \n",
    "          cat= Namespace(\"http://www.programmableweb.com/category/\"), \n",
    "          rdf = RDF, gr = Namespace(\"http://purl.org/goodrelations/v1#\"), \n",
    "          pw_api = Namespace(\"http://www.programmableweb.com/api/\"),\n",
    "          xsd = Namespace(\"http://www.w3.org/2001/XMLSchema#\"))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def compose_query(mashup): # return tuple of number of required services,list of required categories and registration date\n",
    "    rows = g.query(\"\"\"SELECT ?t WHERE {\n",
    "                <%s> api_network:tag ?t .}\"\"\" % mashup, initNs=ns) # query select tags by Mashup name\n",
    "    categories = [t[\"?t\"] for t in rows.bindings]\n",
    "    rows = g.query(\"\"\"SELECT ?t WHERE {\n",
    "                <%s> gr:include ?t .}\"\"\" % mashup, initNs=ns)\n",
    "    k = len(rows)\n",
    "    rows = g.query(\"\"\"SELECT ?d WHERE {\n",
    "                    <%s> api_network:registrationDate ?d .\n",
    "                    }\"\"\" % mashup, initNs=ns)\n",
    "    reg_date = [t[\"?d\"].toPython() for t in rows.bindings][0]\n",
    "    rows = g.query(\"\"\"SELECT ?s WHERE {\n",
    "                <%s> ?p api_network:Mashup .\n",
    "                <%s> gr:include ?s .}\"\"\" % (mashup, mashup), initNs=ns) # query select tags by Mashup name\n",
    "    involved_services = [t[\"?s\"] for t in rows.bindings]\n",
    "    return (k, categories, reg_date, involved_services)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 36,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "def union_of_two_lists(first_list, second_list):\n",
    "    in_first = set(first_list)\n",
    "    in_second = set(second_list)\n",
    "    in_second_but_not_in_first = in_second - in_first\n",
    "    result = first_list + list(in_second_but_not_in_first)\n",
    "    return result\n",
    "\n",
    "def score(services, S):\n",
    "    def get_categories(services):\n",
    "        primary_categories = []\n",
    "        secondary_categories = []\n",
    "        for service in services:\n",
    "            rows = g.query(\"\"\"SELECT ?c WHERE {\n",
    "                <%s> api_network:primaryCategory ?c .}\"\"\" % service, initNs=ns)\n",
    "            p_cats = [t[\"?c\"] for t in rows.bindings]\n",
    "            primary_categories = primary_categories + list(set(p_cats) - set(primary_categories))\n",
    "            rows2 = g.query(\"\"\"SELECT ?c WHERE {\n",
    "                <%s> api_network:secondaryCategory ?c .}\"\"\" % service, initNs=ns)\n",
    "            s_cats = [t[\"?c\"] for t in rows2.bindings]\n",
    "            secondary_categories = secondary_categories + list(set(s_cats) - set(secondary_categories))\n",
    "        return (primary_categories, secondary_categories)\n",
    "    \n",
    "    def get_intersections(services, S):\n",
    "        services_categories = get_categories(services)\n",
    "        primary_intersection = [val for val in services_categories[0] if val in S]\n",
    "        secondary_intersection = [val for val in services_categories[1] if val in S]\n",
    "        return (primary_intersection, secondary_intersection)\n",
    "\n",
    "    def sc(services, query):\n",
    "        #services_categories = get_categories(services)\n",
    "        #primary_intersection = [val for val in services_categories[0] if val in S]\n",
    "        #secondary_intersection = [val for val in services_categories[1] if val in S]\n",
    "        intersections = get_intersections(services, S)\n",
    "        return (len(intersections[0])+0.3*len(intersections[1]))/len(S) # number of requested categories in service is devided by size of requested categories\n",
    "\n",
    "    def re(services, query):\n",
    "        #services_categories = get_categories(services)\n",
    "        #primary_intersection = [val for val in services_categories[0] if val in S]\n",
    "        #secondary_intersection = [val for val in services_categories[1] if val in S]\n",
    "        #intersection = [val for val in services_categories if val in S]\n",
    "        intersections = get_intersections(services, S)\n",
    "        categories = get_categories(services)\n",
    "        provided_categories = union_of_two_lists(categories[0], categories[1])\n",
    "        return len(intersections[0])+0.3*len(intersections[1])#)/len(provided_categories) # number of requested categories in service is devided by size of provided categories\n",
    "\n",
    "    def activation_time_mapping_function(n_days):\n",
    "        x = np.arange(0.,3.,0.001) # define range\n",
    "        y = np.exp(4*(-x)) # define exponential function, b=4 just an example\n",
    "        return y[n_days]\n",
    "    \n",
    "    def dt_for_single_service(service):\n",
    "        rows = g.query(\"\"\"SELECT ?d WHERE {\n",
    "                    <%s> api_network:registrationDate ?d .\n",
    "                    }\"\"\" % service, initNs=ns)\n",
    "        reg_date = [t[\"?d\"].toPython() for t in rows.bindings][0]\n",
    "        rows = g.query(\"\"\"SELECT ?d1 WHERE {\n",
    "                    ?m gr:include <%s> .\n",
    "                    ?m api_network:registrationDate ?d1 .\n",
    "                    }\"\"\" % service, initNs=ns)\n",
    "        mashup_reg_date = [t[\"?d1\"].toPython() for t in rows.bindings]\n",
    "        if not mashup_reg_date:\n",
    "            activation_time = 0 # if service has not been activated, then activation_time is 0\n",
    "        else:\n",
    "            mrd = Series(mashup_reg_date) # turn list to Series\n",
    "            first_mashup_registration_date = mrd[mrd>=reg_date].min() # get rid of negative registrations\n",
    "            try:\n",
    "                activation_time = first_mashup_registration_date - reg_date\n",
    "                activation_time = activation_time.days # convert from timedelta to days\n",
    "                activation_time = activation_time_mapping_function(activation_time) # mapping from days to score\n",
    "            except:\n",
    "                activation_time = 0\n",
    "        return activation_time\n",
    "    \n",
    "    def dt(services):\n",
    "        result = 0\n",
    "        for service in services:\n",
    "            result = result + dt_for_single_service(service)\n",
    "        return result\n",
    "    return [sc(services, S), re(services, S), 0.3*dt(services)]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 8,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "1.7988023968031974"
      ]
     },
     "execution_count": 8,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "mashup = \"http://www.programmableweb.com/mashup/8by1\"\n",
    "service = \"http://www.programmableweb.com/api/google-maps\"\n",
    "user_query = compose_query(mashup)\n",
    "sum(score([service], user_query[1]))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 15,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "#select services which provides one or more categories\n",
    "# TODO add filter date\n",
    "def get_services_by_category(category, reg_date):\n",
    "    rows = g.query(\"\"\"SELECT DISTINCT ?s WHERE {?s ?p api_network:API .\n",
    "                ?s api_network:primaryCategory|api_network:secondaryCategory cat:%s .\n",
    "                ?m ?p api_network:Mashup .\n",
    "                ?m gr:include ?s .\n",
    "                }\"\"\" % category, initNs=ns)\n",
    "    return [t[\"?s\"] for t in rows.bindings]\n",
    "\n",
    "def candidate_set(query):\n",
    "    reg_date = query[2]\n",
    "    set_of_services = []\n",
    "    for category in query[1]:\n",
    "        category = category.toPython().replace(\"http://www.programmableweb.com/category/\", \"\")\n",
    "        services = get_services_by_category(category, query[2])\n",
    "        set_of_services = set_of_services + list(set(services) - set(set_of_services))\n",
    "    return set_of_services"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 16,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "3\n",
      "[rdflib.term.URIRef('http://www.programmableweb.com/category/mapping'), rdflib.term.URIRef('http://www.programmableweb.com/category/shipping')]\n",
      "158\n"
     ]
    }
   ],
   "source": [
    "mashup = \"http://www.programmableweb.com/mashup/packagemapper.com\"\n",
    "user_query = compose_query(mashup)\n",
    "M = candidate_set(user_query) # set of candidate services\n",
    "S = user_query[1] # set of requested tags\n",
    "k = user_query[0] # length of required recommendation set\n",
    "print(k)\n",
    "print(S)\n",
    "print(len(M))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 17,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "#main experiment\n",
    "def Greedy(S, M, k, e=0.1):\n",
    "    I = [] # recommendation set of services\n",
    "    B = 0 # current score\n",
    "    for i in range(k):\n",
    "        B_table=[]\n",
    "        for service in M:\n",
    "            temp_I = I + [service]\n",
    "            curr_score = score(temp_I, S)\n",
    "            B_table.append((temp_I, sum(curr_score)))\n",
    "        max_elem = max(B_table, key=operator.itemgetter(1)) \n",
    "        I = max_elem[0]\n",
    "        #print(I)\n",
    "        B = max_elem[1]\n",
    "        #print(max_elem[1])\n",
    "        M = [x for x in M if x not in I] # delete added element from candidate set\n",
    "    return (I, B)\n",
    "    \n",
    "            \n",
    "        "
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 34,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "name": "stdout",
     "output_type": "stream",
     "text": [
      "[rdflib.term.URIRef('http://www.programmableweb.com/api/zeemaps')]\n",
      "2.5\n",
      "[rdflib.term.URIRef('http://www.programmableweb.com/api/zeemaps'), rdflib.term.URIRef('http://www.programmableweb.com/api/shipstation')]\n",
      "3.5\n",
      "[rdflib.term.URIRef('http://www.programmableweb.com/api/zeemaps'), rdflib.term.URIRef('http://www.programmableweb.com/api/shipstation'), rdflib.term.URIRef('http://www.programmableweb.com/api/globexplorer')]\n",
      "4.49600798934\n"
     ]
    }
   ],
   "source": [
    "result = Greedy(S, M, k)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 35,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([rdflib.term.URIRef('http://www.programmableweb.com/api/zeemaps'),\n",
       "  rdflib.term.URIRef('http://www.programmableweb.com/api/shipstation'),\n",
       "  rdflib.term.URIRef('http://www.programmableweb.com/api/globexplorer')],\n",
       " 4.4960079893439913)"
      ]
     },
     "execution_count": 35,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "result"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 18,
   "metadata": {
    "collapsed": true
   },
   "outputs": [],
   "source": [
    "def compute_precision(result, query):\n",
    "    actual_services = query[3]\n",
    "    intersection = [val for val in actual_services if val in result[0]]\n",
    "    return len(intersection)/len(result[0])\n",
    "    \n",
    "def compute_recall(result, query):\n",
    "    actual_services = query[3]\n",
    "    intersection = [val for val in actual_services if val in result[0]]\n",
    "    return len(intersection)/len(actual_services)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 29,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "#lets try to emulate a single experiment\n",
    "def single_experiment(mashup):\n",
    "    user_query = compose_query(mashup)\n",
    "    M = candidate_set(user_query) # set of candidate services\n",
    "    S = user_query[1] # set of requested tags\n",
    "    k = user_query[0] # length of required recommendation set\n",
    "    result = Greedy(S, M, k)\n",
    "    #print(result)\n",
    "    precision = compute_precision(result, user_query)\n",
    "    recall = compute_recall(result, user_query)\n",
    "    return (precision, recall) # return precision and recall"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 20,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "# select mashups for experiment\n",
    "rows = g.query(\"\"\"SELECT ?m ?d WHERE {?m ?p api_network:Mashup .\n",
    "                    ?m api_network:registrationDate ?d .}\"\"\" , initNs=ns)\n",
    "mashup_regs = DataFrame()\n",
    "mashup_regs[\"Mashup\"] = [t[\"?m\"].toPython() for t in rows.bindings]\n",
    "mashup_regs[\"Registration\"] = [t[\"?d\"].toPython() for t in rows.bindings]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 39,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "16"
      ]
     },
     "execution_count": 39,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "#mashup_regs.sort(\"Registration\", ascending = 0)\n",
    "mashup_for_experiment = mashup_regs[mashup_regs[\"Registration\"]>datetime.date(2015, 1, 1)][\"Mashup\"] #select 65 mashups\n",
    "len(mashup_for_experiment)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 37,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "precision_recall_frame = DataFrame()\n",
    "for mashup in mashup_for_experiment:\n",
    "    precision,recall = single_experiment(mashup)\n",
    "    df = DataFrame([[mashup, precision, recall]], columns = [\"Mashup\", \"Precision\", \"Recall\"])\n",
    "    precision_recall_frame = precision_recall_frame.append(df, ignore_index=True)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 40,
   "metadata": {
    "collapsed": false
   },
   "outputs": [],
   "source": [
    "#precision_recall_frame"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 52,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[0.65, 1.1, 0.74022922592493667]"
      ]
     },
     "execution_count": 52,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "services = [\"http://www.programmableweb.com/api/geoplugin\", \"http://www.programmableweb.com/api/zeemaps\", \"http://www.programmableweb.com/api/globexplorer\"]\n",
    "score(services, S)"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 53,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[1.0, 0.4, 0.77992822142872187]"
      ]
     },
     "execution_count": 53,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "services = [\"http://www.programmableweb.com/api/fedex\", \"http://www.programmableweb.com/api/google-maps\", \"http://www.programmableweb.com/api/yahoo-geocoding\"]\n",
    "score(services, S)"
   ]
  },
  {
   "cell_type": "markdown",
   "metadata": {},
   "source": [
    "#Run experiment for 65 mashups published after 01-01-2015#"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 5,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>Mashup</th>\n",
       "      <th>Precision</th>\n",
       "      <th>Recall</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>http://www.programmableweb.com/mashup/anything...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>1</th>\n",
       "      <td>1</td>\n",
       "      <td>http://www.programmableweb.com/mashup/moonotes</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>2</th>\n",
       "      <td>2</td>\n",
       "      <td>http://www.programmableweb.com/mashup/ifixit-a...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>http://www.programmableweb.com/mashup/maco-tra...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>4</th>\n",
       "      <td>4</td>\n",
       "      <td>http://www.programmableweb.com/mashup/magento-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>5</th>\n",
       "      <td>5</td>\n",
       "      <td>http://www.programmableweb.com/mashup/placeprint</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>6</th>\n",
       "      <td>6</td>\n",
       "      <td>http://www.programmableweb.com/mashup/idealist...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>7</th>\n",
       "      <td>7</td>\n",
       "      <td>http://www.programmableweb.com/mashup/sap-fico...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>8</th>\n",
       "      <td>8</td>\n",
       "      <td>http://www.programmableweb.com/mashup/weglore-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>http://www.programmableweb.com/mashup/equaldex...</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>10</td>\n",
       "      <td>http://www.programmableweb.com/mashup/99design...</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>11</th>\n",
       "      <td>11</td>\n",
       "      <td>http://www.programmableweb.com/mashup/slick-de...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>12</th>\n",
       "      <td>12</td>\n",
       "      <td>http://www.programmableweb.com/mashup/profile-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>13</th>\n",
       "      <td>13</td>\n",
       "      <td>http://www.programmableweb.com/mashup/bitcoin-atm</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>14</th>\n",
       "      <td>14</td>\n",
       "      <td>http://www.programmableweb.com/mashup/weather-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>15</th>\n",
       "      <td>15</td>\n",
       "      <td>http://www.programmableweb.com/mashup/streamboxr</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>16</th>\n",
       "      <td>16</td>\n",
       "      <td>http://www.programmableweb.com/mashup/simple-l...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>17</th>\n",
       "      <td>17</td>\n",
       "      <td>http://www.programmableweb.com/mashup/touristica</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>18</td>\n",
       "      <td>http://www.programmableweb.com/mashup/zilyo-va...</td>\n",
       "      <td>0.200000</td>\n",
       "      <td>0.200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>19</th>\n",
       "      <td>19</td>\n",
       "      <td>http://www.programmableweb.com/mashup/theonespy</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>20</th>\n",
       "      <td>20</td>\n",
       "      <td>http://www.programmableweb.com/mashup/moves-el...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>21</th>\n",
       "      <td>21</td>\n",
       "      <td>http://www.programmableweb.com/mashup/screenah</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>22</td>\n",
       "      <td>http://www.programmableweb.com/mashup/ibeeking</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>23</th>\n",
       "      <td>23</td>\n",
       "      <td>http://www.programmableweb.com/mashup/data-vis...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>24</th>\n",
       "      <td>24</td>\n",
       "      <td>http://www.programmableweb.com/mashup/geoloqi-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>25</th>\n",
       "      <td>25</td>\n",
       "      <td>http://www.programmableweb.com/mashup/expin.me</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>26</th>\n",
       "      <td>26</td>\n",
       "      <td>http://www.programmableweb.com/mashup/nostalgia</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>27</th>\n",
       "      <td>27</td>\n",
       "      <td>http://www.programmableweb.com/mashup/athenaeum</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>28</th>\n",
       "      <td>28</td>\n",
       "      <td>http://www.programmableweb.com/mashup/bookafy-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>29</th>\n",
       "      <td>29</td>\n",
       "      <td>http://www.programmableweb.com/mashup/coopcities</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>...</th>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "      <td>...</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>35</th>\n",
       "      <td>35</td>\n",
       "      <td>http://www.programmableweb.com/mashup/collecti...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>36</th>\n",
       "      <td>36</td>\n",
       "      <td>http://www.programmableweb.com/mashup/meteo-ma...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>37</th>\n",
       "      <td>37</td>\n",
       "      <td>http://www.programmableweb.com/mashup/jobjolly</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>38</th>\n",
       "      <td>38</td>\n",
       "      <td>http://www.programmableweb.com/mashup/moves-mo...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>39</td>\n",
       "      <td>http://www.programmableweb.com/mashup/windshie...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>40</td>\n",
       "      <td>http://www.programmableweb.com/mashup/intellin...</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>41</th>\n",
       "      <td>41</td>\n",
       "      <td>http://www.programmableweb.com/mashup/bookstea...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>42</th>\n",
       "      <td>42</td>\n",
       "      <td>http://www.programmableweb.com/mashup/zabra</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>43</th>\n",
       "      <td>43</td>\n",
       "      <td>http://www.programmableweb.com/mashup/criminal...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>44</th>\n",
       "      <td>44</td>\n",
       "      <td>http://www.programmableweb.com/mashup/followfly</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>45</th>\n",
       "      <td>45</td>\n",
       "      <td>http://www.programmableweb.com/mashup/usersthink</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>46</th>\n",
       "      <td>46</td>\n",
       "      <td>http://www.programmableweb.com/mashup/bitcoin-...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>47</th>\n",
       "      <td>47</td>\n",
       "      <td>http://www.programmableweb.com/mashup/bing-map...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>48</td>\n",
       "      <td>http://www.programmableweb.com/mashup/stel-order</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>49</td>\n",
       "      <td>http://www.programmableweb.com/mashup/mashit</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>50</th>\n",
       "      <td>50</td>\n",
       "      <td>http://www.programmableweb.com/mashup/222acres...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>51</th>\n",
       "      <td>51</td>\n",
       "      <td>http://www.programmableweb.com/mashup/online-b...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>52</th>\n",
       "      <td>52</td>\n",
       "      <td>http://www.programmableweb.com/mashup/strava-s...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>53</th>\n",
       "      <td>53</td>\n",
       "      <td>http://www.programmableweb.com/mashup/oznewsy</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>54</th>\n",
       "      <td>54</td>\n",
       "      <td>http://www.programmableweb.com/mashup/se-ranking</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>55</th>\n",
       "      <td>55</td>\n",
       "      <td>http://www.programmableweb.com/mashup/itavli-i...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>56</th>\n",
       "      <td>56</td>\n",
       "      <td>http://www.programmableweb.com/mashup/segment</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>57</th>\n",
       "      <td>57</td>\n",
       "      <td>http://www.programmableweb.com/mashup/swyft</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>58</th>\n",
       "      <td>58</td>\n",
       "      <td>http://www.programmableweb.com/mashup/grasshopper</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>59</th>\n",
       "      <td>59</td>\n",
       "      <td>http://www.programmableweb.com/mashup/ifixit-ios</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>60</td>\n",
       "      <td>http://www.programmableweb.com/mashup/pricemac...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>61</th>\n",
       "      <td>61</td>\n",
       "      <td>http://www.programmableweb.com/mashup/moves-ma...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>62</th>\n",
       "      <td>62</td>\n",
       "      <td>http://www.programmableweb.com/mashup/serendip...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>63</th>\n",
       "      <td>63</td>\n",
       "      <td>http://www.programmableweb.com/mashup/sdmx-sax...</td>\n",
       "      <td>0.000000</td>\n",
       "      <td>0.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>64</td>\n",
       "      <td>http://www.programmableweb.com/mashup/jabify</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "<p>65 rows × 4 columns</p>\n",
       "</div>"
      ],
      "text/plain": [
       "    Unnamed: 0                                             Mashup  Precision  \\\n",
       "0            0  http://www.programmableweb.com/mashup/anything...   1.000000   \n",
       "1            1     http://www.programmableweb.com/mashup/moonotes   0.000000   \n",
       "2            2  http://www.programmableweb.com/mashup/ifixit-a...   0.000000   \n",
       "3            3  http://www.programmableweb.com/mashup/maco-tra...   1.000000   \n",
       "4            4  http://www.programmableweb.com/mashup/magento-...   0.000000   \n",
       "5            5   http://www.programmableweb.com/mashup/placeprint   0.000000   \n",
       "6            6  http://www.programmableweb.com/mashup/idealist...   0.000000   \n",
       "7            7  http://www.programmableweb.com/mashup/sap-fico...   0.000000   \n",
       "8            8  http://www.programmableweb.com/mashup/weglore-...   0.000000   \n",
       "9            9  http://www.programmableweb.com/mashup/equaldex...   0.333333   \n",
       "10          10  http://www.programmableweb.com/mashup/99design...   0.500000   \n",
       "11          11  http://www.programmableweb.com/mashup/slick-de...   0.000000   \n",
       "12          12  http://www.programmableweb.com/mashup/profile-...   0.000000   \n",
       "13          13  http://www.programmableweb.com/mashup/bitcoin-atm   0.000000   \n",
       "14          14  http://www.programmableweb.com/mashup/weather-...   0.000000   \n",
       "15          15   http://www.programmableweb.com/mashup/streamboxr   0.000000   \n",
       "16          16  http://www.programmableweb.com/mashup/simple-l...   0.000000   \n",
       "17          17   http://www.programmableweb.com/mashup/touristica   0.000000   \n",
       "18          18  http://www.programmableweb.com/mashup/zilyo-va...   0.200000   \n",
       "19          19    http://www.programmableweb.com/mashup/theonespy   0.000000   \n",
       "20          20  http://www.programmableweb.com/mashup/moves-el...   0.000000   \n",
       "21          21     http://www.programmableweb.com/mashup/screenah   0.000000   \n",
       "22          22     http://www.programmableweb.com/mashup/ibeeking   1.000000   \n",
       "23          23  http://www.programmableweb.com/mashup/data-vis...   0.000000   \n",
       "24          24  http://www.programmableweb.com/mashup/geoloqi-...   0.000000   \n",
       "25          25     http://www.programmableweb.com/mashup/expin.me   0.000000   \n",
       "26          26    http://www.programmableweb.com/mashup/nostalgia   0.000000   \n",
       "27          27    http://www.programmableweb.com/mashup/athenaeum   0.000000   \n",
       "28          28  http://www.programmableweb.com/mashup/bookafy-...   0.000000   \n",
       "29          29   http://www.programmableweb.com/mashup/coopcities   0.000000   \n",
       "..         ...                                                ...        ...   \n",
       "35          35  http://www.programmableweb.com/mashup/collecti...   0.000000   \n",
       "36          36  http://www.programmableweb.com/mashup/meteo-ma...   0.000000   \n",
       "37          37     http://www.programmableweb.com/mashup/jobjolly   0.000000   \n",
       "38          38  http://www.programmableweb.com/mashup/moves-mo...   0.000000   \n",
       "39          39  http://www.programmableweb.com/mashup/windshie...   1.000000   \n",
       "40          40  http://www.programmableweb.com/mashup/intellin...   0.500000   \n",
       "41          41  http://www.programmableweb.com/mashup/bookstea...   0.000000   \n",
       "42          42        http://www.programmableweb.com/mashup/zabra   0.000000   \n",
       "43          43  http://www.programmableweb.com/mashup/criminal...   0.000000   \n",
       "44          44    http://www.programmableweb.com/mashup/followfly   0.000000   \n",
       "45          45   http://www.programmableweb.com/mashup/usersthink   0.000000   \n",
       "46          46  http://www.programmableweb.com/mashup/bitcoin-...   0.000000   \n",
       "47          47  http://www.programmableweb.com/mashup/bing-map...   0.000000   \n",
       "48          48   http://www.programmableweb.com/mashup/stel-order   1.000000   \n",
       "49          49       http://www.programmableweb.com/mashup/mashit   1.000000   \n",
       "50          50  http://www.programmableweb.com/mashup/222acres...   0.000000   \n",
       "51          51  http://www.programmableweb.com/mashup/online-b...   0.000000   \n",
       "52          52  http://www.programmableweb.com/mashup/strava-s...   0.000000   \n",
       "53          53      http://www.programmableweb.com/mashup/oznewsy   0.000000   \n",
       "54          54   http://www.programmableweb.com/mashup/se-ranking   0.000000   \n",
       "55          55  http://www.programmableweb.com/mashup/itavli-i...   0.000000   \n",
       "56          56      http://www.programmableweb.com/mashup/segment   0.000000   \n",
       "57          57        http://www.programmableweb.com/mashup/swyft   0.000000   \n",
       "58          58  http://www.programmableweb.com/mashup/grasshopper   0.000000   \n",
       "59          59   http://www.programmableweb.com/mashup/ifixit-ios   0.000000   \n",
       "60          60  http://www.programmableweb.com/mashup/pricemac...   1.000000   \n",
       "61          61  http://www.programmableweb.com/mashup/moves-ma...   0.000000   \n",
       "62          62  http://www.programmableweb.com/mashup/serendip...   0.000000   \n",
       "63          63  http://www.programmableweb.com/mashup/sdmx-sax...   0.000000   \n",
       "64          64       http://www.programmableweb.com/mashup/jabify   1.000000   \n",
       "\n",
       "      Recall  \n",
       "0   1.000000  \n",
       "1   0.000000  \n",
       "2   0.000000  \n",
       "3   1.000000  \n",
       "4   0.000000  \n",
       "5   0.000000  \n",
       "6   0.000000  \n",
       "7   0.000000  \n",
       "8   0.000000  \n",
       "9   0.333333  \n",
       "10  0.500000  \n",
       "11  0.000000  \n",
       "12  0.000000  \n",
       "13  0.000000  \n",
       "14  0.000000  \n",
       "15  0.000000  \n",
       "16  0.000000  \n",
       "17  0.000000  \n",
       "18  0.200000  \n",
       "19  0.000000  \n",
       "20  0.000000  \n",
       "21  0.000000  \n",
       "22  1.000000  \n",
       "23  0.000000  \n",
       "24  0.000000  \n",
       "25  0.000000  \n",
       "26  0.000000  \n",
       "27  0.000000  \n",
       "28  0.000000  \n",
       "29  0.000000  \n",
       "..       ...  \n",
       "35  0.000000  \n",
       "36  0.000000  \n",
       "37  0.000000  \n",
       "38  0.000000  \n",
       "39  1.000000  \n",
       "40  0.500000  \n",
       "41  0.000000  \n",
       "42  0.000000  \n",
       "43  0.000000  \n",
       "44  0.000000  \n",
       "45  0.000000  \n",
       "46  0.000000  \n",
       "47  0.000000  \n",
       "48  1.000000  \n",
       "49  1.000000  \n",
       "50  0.000000  \n",
       "51  0.000000  \n",
       "52  0.000000  \n",
       "53  0.000000  \n",
       "54  0.000000  \n",
       "55  0.000000  \n",
       "56  0.000000  \n",
       "57  0.000000  \n",
       "58  0.000000  \n",
       "59  0.000000  \n",
       "60  1.000000  \n",
       "61  0.000000  \n",
       "62  0.000000  \n",
       "63  0.000000  \n",
       "64  1.000000  \n",
       "\n",
       "[65 rows x 4 columns]"
      ]
     },
     "execution_count": 5,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "table = pnd.read_csv(\"precision_recall_df.csv\")\n",
    "table"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 4,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/html": [
       "<div>\n",
       "<table border=\"1\" class=\"dataframe\">\n",
       "  <thead>\n",
       "    <tr style=\"text-align: right;\">\n",
       "      <th></th>\n",
       "      <th>Unnamed: 0</th>\n",
       "      <th>Mashup</th>\n",
       "      <th>Precision</th>\n",
       "      <th>Recall</th>\n",
       "    </tr>\n",
       "  </thead>\n",
       "  <tbody>\n",
       "    <tr>\n",
       "      <th>0</th>\n",
       "      <td>0</td>\n",
       "      <td>http://www.programmableweb.com/mashup/anything...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>3</th>\n",
       "      <td>3</td>\n",
       "      <td>http://www.programmableweb.com/mashup/maco-tra...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>9</th>\n",
       "      <td>9</td>\n",
       "      <td>http://www.programmableweb.com/mashup/equaldex...</td>\n",
       "      <td>0.333333</td>\n",
       "      <td>0.333333</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>10</th>\n",
       "      <td>10</td>\n",
       "      <td>http://www.programmableweb.com/mashup/99design...</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>18</th>\n",
       "      <td>18</td>\n",
       "      <td>http://www.programmableweb.com/mashup/zilyo-va...</td>\n",
       "      <td>0.200000</td>\n",
       "      <td>0.200000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>22</th>\n",
       "      <td>22</td>\n",
       "      <td>http://www.programmableweb.com/mashup/ibeeking</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>39</th>\n",
       "      <td>39</td>\n",
       "      <td>http://www.programmableweb.com/mashup/windshie...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>40</th>\n",
       "      <td>40</td>\n",
       "      <td>http://www.programmableweb.com/mashup/intellin...</td>\n",
       "      <td>0.500000</td>\n",
       "      <td>0.500000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>48</th>\n",
       "      <td>48</td>\n",
       "      <td>http://www.programmableweb.com/mashup/stel-order</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>49</th>\n",
       "      <td>49</td>\n",
       "      <td>http://www.programmableweb.com/mashup/mashit</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>60</th>\n",
       "      <td>60</td>\n",
       "      <td>http://www.programmableweb.com/mashup/pricemac...</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "    <tr>\n",
       "      <th>64</th>\n",
       "      <td>64</td>\n",
       "      <td>http://www.programmableweb.com/mashup/jabify</td>\n",
       "      <td>1.000000</td>\n",
       "      <td>1.000000</td>\n",
       "    </tr>\n",
       "  </tbody>\n",
       "</table>\n",
       "</div>"
      ],
      "text/plain": [
       "    Unnamed: 0                                             Mashup  Precision  \\\n",
       "0            0  http://www.programmableweb.com/mashup/anything...   1.000000   \n",
       "3            3  http://www.programmableweb.com/mashup/maco-tra...   1.000000   \n",
       "9            9  http://www.programmableweb.com/mashup/equaldex...   0.333333   \n",
       "10          10  http://www.programmableweb.com/mashup/99design...   0.500000   \n",
       "18          18  http://www.programmableweb.com/mashup/zilyo-va...   0.200000   \n",
       "22          22     http://www.programmableweb.com/mashup/ibeeking   1.000000   \n",
       "39          39  http://www.programmableweb.com/mashup/windshie...   1.000000   \n",
       "40          40  http://www.programmableweb.com/mashup/intellin...   0.500000   \n",
       "48          48   http://www.programmableweb.com/mashup/stel-order   1.000000   \n",
       "49          49       http://www.programmableweb.com/mashup/mashit   1.000000   \n",
       "60          60  http://www.programmableweb.com/mashup/pricemac...   1.000000   \n",
       "64          64       http://www.programmableweb.com/mashup/jabify   1.000000   \n",
       "\n",
       "      Recall  \n",
       "0   1.000000  \n",
       "3   1.000000  \n",
       "9   0.333333  \n",
       "10  0.500000  \n",
       "18  0.200000  \n",
       "22  1.000000  \n",
       "39  1.000000  \n",
       "40  0.500000  \n",
       "48  1.000000  \n",
       "49  1.000000  \n",
       "60  1.000000  \n",
       "64  1.000000  "
      ]
     },
     "execution_count": 4,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "table[table[\"Precision\"]>0]"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 151,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "([rdflib.term.URIRef('http://www.programmableweb.com/api/zeemaps')], 2.25)"
      ]
     },
     "execution_count": 151,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import operator\n",
    "#max(b_table,key=itemgetter(1))[0]\n",
    "max(result, key=operator.itemgetter(1))"
   ]
  },
  {
   "cell_type": "code",
   "execution_count": 122,
   "metadata": {
    "collapsed": false
   },
   "outputs": [
    {
     "data": {
      "text/plain": [
       "[('c', 100), ('a', 3000), ('b', 3000)]"
      ]
     },
     "execution_count": 122,
     "metadata": {},
     "output_type": "execute_result"
    }
   ],
   "source": [
    "import operator\n",
    "stats = {'a':3000, 'b':3000, 'c': 100}\n",
    "sorted_x = sorted(stats.items(), key=operator.itemgetter(1))\n",
    "sorted_x\n",
    "#b_table[max(b_table, key=b_table.get)]"
   ]
  }
 ],
 "metadata": {
  "kernelspec": {
   "display_name": "Python 3",
   "language": "python",
   "name": "python3"
  },
  "language_info": {
   "codemirror_mode": {
    "name": "ipython",
    "version": 3
   },
   "file_extension": ".py",
   "mimetype": "text/x-python",
   "name": "python",
   "nbconvert_exporter": "python",
   "pygments_lexer": "ipython3",
   "version": "3.4.3"
  }
 },
 "nbformat": 4,
 "nbformat_minor": 0
}
